[
    {
        "id": 1,
        "profile_photo": "https://drive.google.com/uc?export=view&id=1rKDJxi0X4o6_yz5zlLH8CKIklnMvfLC1",
        "account_name": "Muhammad Alfaridzi",
        "verified_check": "https://img.icons8.com/?size=512&id=2sZ0sdlG9kWP&format=png",
        "post_image": "https://drive.usercontent.google.com/download?id=1rFqWkUwZFJ0Vw959V8jbWBh2HYsO7LQa&export=view&authuser=0",
        "caption": "<p><b>SEPAKBOLA</b> - Timnas Indonesia resmi melangkah ke ronde keempat Kualifikasi Piala Dunia 2026 zona Asia setelah Arab Saudi mengalahkan Bahrain 2-0 di Bahrain National Stadium, Selasa (6/6/2025) dini hari WITA.</p><p>Berkat hasil pertandingan tersebut, skuad Garuda dipastikan aman dari kejaran tim-tim di bawahnya dalam perolehan poin di Grup C. Saat ini, Indonesia menempati posisi keempat papan klasemen dengan mengantongi 12 poin, disusul Bahrain di posisi kelima, dan China yang tertahan sebagai juru kunci.</p><p>Persaingan di papan bawah masih menyisakan duel antara Bahrain dan Cina, yang juga sama-sama mengoleksi 6 poin. Namun, poin maksimal yang bisa diraih oleh pemenang duel tersebut hanyalah sembilan poin. Angka ini masih terpaut jauh di bawah Indonesia, sekalipun timnas Indonesia akan menelan kekalahan di laga pamungkas kontra Jepang.</p><p>Ronde keempat nantinya akan diikuti 6 tim, yakni tim peringkat ketiga dan keempat dari tiga grup di ronde ketiga. Keenam tim ini akan dibagi ke dalam dua grup berisi tiga tim dan bermain dengan sistem round robin di tempat netral. Juara masing-masing grup berhak lolos langsung ke Piala Dunia 2026, sementara runner-up akan bertanding di ronde kelima untuk memperebutkan tiket play-off antar konfederasi.</p><p>Ketua Umum PSSI Erick Thohir menyampaikan rasa syukur atas pencapaian ini melalui Instagram resminya.</p><p>\"Alhamdulillah kemenangan Timnas Indonesia atas China serta Arab Saudi yang meraih kemenangan atas Bahrain membuat Indonesia memastikan langkah ke Babak 4 Kualifikasi Piala Dunia 2026 Zona Asia,\" tulis Thohir.</p><p>Ia menambahkan apresiasi kepada seluruh tim pelatih, pemain, ofisial, dan suporter yang telah berjuang. \"Belum saatnya puas, kita masih harus berjuang untuk bisa membawa Indonesia tampil di Piala Dunia,\" tegasnya. (*)</p><p>#TimnasDay #GarudaMendunia #KualifikasiPialaDunia2026</p>",
        "date": "2025-06-06"
    }
]